atmark-techno/m33-firmware-at/pin_mux.h
/*
 * Copyright 2023 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

void BOARD_InitBootPins(void);
void BOARD_InitConsolePins(void);
void BOARD_DeinitConsolePins(void);
void BOARD_InitI2cPins(void);
void BOARD_InitPmicI2cPins(void);
void BOARD_InitTpmPins(void);
void BOARD_InitHdmiIntPins(void);
void BOARD_InitPmicModePins(void);
void BOARD_InitWdogPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
